Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། ཐེག་པ་ཆེན་པོ་ཡོད་པར་མངོན་ནམ།
en: Would the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, and the Great Vehicle be clearly discerned?

source: དད་པའི་རྗེས་སུ་འབྲང་བ་དང་། ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། བརྒྱད་པ་ཡོད་པར་མངོན་ནམ། རྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་།
en: Would followers on account of faith, followers of the Dharma, and those on the eighth level be clearly discerned?

source: ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོད་པར་མངོན་ནམ།
en: Would those entering the stream to nirvāṇa, those destined for only one more rebirth, those no longer subject to rebirth, arhats, pratyekabuddhas, bodhisattvas, and tathāgatas, arhats, completely awakened buddhas be clearly discerned?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཆོས་དེ་དག་ཐམས་ཅད་ནི་མཆིས་པར་མངོན་པར་མི་འགྱུར་རོ།
en: Blessed Lord, all these would not be clearly discerned.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ལྟ་བས་ན།
en: Therefore, Subhūti,” continued the Blessed One, {Ki.

source: དེ་ལྟར་ཆོས་མཉམ་པ་ཉིད་ལས་ཀྱང་མི་གཡོ་ལ་ཆོས་རྣམས་རྣམ་པར་དགོད་པར་མཛད་པ་ནི། དེ་བཞིན་གཤེགས་པའི་མཐུའོ།
en: VIII: 172} “it is within the power of the tathāgatas to establish all these attributes without stirring from the sameness of all phenomena.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་ཆོས་མཉམ་པ་ཉིད་ལས་མི་གཡོ་བ་དེ་བཞིན་དུ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱང་ཆོས་མཉམ་པ་ཉིད་ལས་མི་གཡོ་བ་ལགས་སམ། དེ་བཞིན་དུ་དད་པའི་རྗེས་སུ་འབྲང་བ་རྣམས་དང་། །ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་རྣམས་དང་། བརྒྱད་པ་དང་། རྒྱུན་ཏུ་ཞུགས་པ་རྣམས་དང་།
en: Blessed Lord, just as the tathāgatas do not stir from the sameness of phenomena, in the same way is it the case that ordinary persons, too, do not stir from the sameness of phenomena?

source: ལན་ཅིག་ཕྱིར་འོང་བ་རྣམས་དང་། ཕྱིར་མི་འོང་བ་རྣམས་དང་། དགྲ་བཅོམ་པ་རྣམས་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཆོས་མཉམ་པ་ཉིད་ལས་མི་གཡོ་བ་ལགས་སམ།
en: Similarly, is it the case that followers on account of faith, followers of the Dharma, those of the eighth level, those entering the stream to nirvāṇa, those destined for only one more rebirth, those no longer subject to rebirth, arhats, pratyekabuddhas, and bodhisattvas, too, do not stir from the sameness of phenomena?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: Subhūti, it is so! It is so,” replied the Blessed One. “

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་ཆོས་མཉམ་པ་ཉིད་ལས་མི་གཡོའོ།
en: Subhūti, nothing stirs from the sameness of phenomena.

source: །ཆོས་མཉམ་པ་ཉིད་ལས་མི་འདའོ།
en: Nothing transcends the sameness of phenomena.

source: །རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ནི་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་གང་ཡིན་པ་དེ་ཉིད་ནི་སོ་སོ་སྐྱེ་བོ་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་།
en: If you ask why, Subhūti, it is because the real nature of the tathāgatas, arhats, completely awakened buddhas—their unmistaken real nature, one and only real nature, reality, realm of phenomena, abiding nature of reality, maturity with respect to all phenomena, and very limit of reality—is also the real nature of ordinary persons—their unmistaken real nature, one and only real nature, reality, realm of phenomena, abiding nature of reality, maturity with respect to all phenomena, and very limit of reality.

source: ཡང་དག་པའི་མཐའ་སྟེ། དེ་ཉིད་ནི་དད་པའི་རྗེས་སུ་འབྲང་བ་རྣམས་དང་། ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་རྣམས་དང་། བརྒྱད་པ་དང་། རྒྱུན་ཏུ་ཞུགས་པ་རྣམས་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་རྣམས་དང་། ཕྱིར་མི་འོང་བ་རྣམས་དང་། དགྲ་བཅོམ་པ་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི། དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་།
en: It is also the real nature of followers on account of faith, followers of the Dharma, those of the eighth level, those entering the stream to nirvāṇa, those destined for only one more rebirth, those no longer subject to rebirth, arhats, pratyekabuddhas, and bodhisattvas—their unmistaken real nature, one and only real nature, reality, realm of phenomena, abiding nature of reality, maturity with respect to all phenomena, and very limit of reality.

source: ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་སྟེ། དེ་དག་ཐམས་ཅད་ནི་ཆོས་མཉམ་པ་ཉིད་དེ།
en: All these indicate the sameness of phenomena.

source: དེ་དེ་ལས་རྣམ་པར་མི་འདའོ།
en: Nothing transcends it.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་དག་གི་ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། དེ་བཞིན་ཉིད་དང་།
en: If you ask why, it just is their reality, realm of phenomena, abiding nature of reality, maturity with respect to all phenomena, real nature, unmistaken real nature, one and only real nature, and very limit of reality.

source: མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་ནི་དེ་ཉིད་ཡིན་ཏེ། དེ་དག་ལས་ཆོས་མཉམ་པ་ཉིད་ཅེས་བྱ་བ་གཞན་གང་ཡང་མེད་དོ། །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་ཆོས་མཉམ་པ་ཉིད་གང་ལགས་པ་ཉིད་དད་པའི་རྗེས་སུ་འབྲང་བ་རྣམས་དང་། ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་རྣམས་དང་། བརྒྱད་པ་དང་། རྒྱུན་ཏུ་ཞུགས་པ་རྣམས་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་རྣམས་དང་། ཕྱིར་མི་འོང་བ་རྣམས་དང་། དགྲ་བཅོམ་པ་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཆོས་མཉམ་པ་ཉིད་དེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཆོས་མཉམ་པ་ཉིད་ལགས་ན། བཅོམ་ལྡན་འདས་མཚན་ཉིད་མི་འདྲ་བའི་ཆོས་འདི་ལྟ་སྟེ། གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་། སྐྱེ་མཆེད་དང་། ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཐབས་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སྟོ
en: There is nothing else apart from these that would be called the sameness of phenomena.”

source: བས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་དང་། འདུས་བྱས་ཀྱི་ཁམས་དང་། འདུས་མ་བྱས་ཀྱི་ཁམས་ཏེ། བཅོམ་ལྡན་འདས་ཆོས་དེ་དག་ཐམས་ཅད་ནི་ཀུན་ཀྱང་གཅིག་དང་གཅིག་ཏུ་མི་འདྲ་བ།
en: Subhūti then asked, “Blessed Lord, if the sameness of phenomena that ordinary people have is itself the sameness of phenomena that followers on account of faith have, and that followers of the Dharma, those of the eighth level, those entering the stream to nirvāṇa, those destined for only one more rebirth, those no longer subject to rebirth, arhats, pratyekabuddhas, and bodhisattvas have, and if it is itself the sameness of phenomena that tathāgatas, arhats, completely awakened buddhas have, in that case, Blessed Lord, how would all those phenomena with dissimilar defining characteristics—including physical forms, feelings, perceptions, formative predispositions, consciousness, the sense fields, the sensory elements, the links of dependent origination, desire, hatred, delusion, all the aspects of wrong view, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, the perfection of wisdom, the perfection of skill in means, the perfection of aspiration, the perfection of power, the perfection of gnosis, the ten levels of the bodhisattvas, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the gateways of liberation—emptiness, signlessness, and wishlessness—the emptiness of internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity, the eight aspects of liberation, the nine serial steps of meditative absorption, the five extrasensory powers, all the meditative stabilities, all the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, the eighteen distinct qualities of the buddhas, the thirty-two major marks of a great person, the eighty excellent minor marks, conditioned elements, and unconditioned elements—indeed, Blessed Lord, have unique defining characteristics that are different from one another? “

source: གཅིག་ལས་གཅིག་འདས་པའོ། །བཅོམ་ལྡན་འདས་དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་ནི་འདི་ལྟར་གཟུགས་ཀྱི་ཆོས་ཉིད་ཀྱང་གཞན། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་ཆོས་ཉིད་ཀྱང་གཞན། སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཆོས་ཉིད་ཀྱང་གཞན། འདོད་ཆགས་ཀྱི་ཆོས་ཉིད་ཀྱང་གཞན། ཞེ་སྡང་གི་ཆོས་ཉིད་ཀྱང་གཞན། གཏི་མུག་གི་ཆོས་ཉིད་ཀྱང་གཞན། ལྟ་བའི་རྣམ་པའི་ཆོས་ཉིད་ཀྱང་གཞན། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཆོས་ཉིད་ཀྱང་གཞན། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཆོས་ཉིད་ཀྱང་གཞན། ནང་སྟོང་པ་ཉིད་ཀྱི་ཆོས་ཉིད་ཀྱང་གཞན། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཆོས་ཉིད་ཀྱང་གཞན། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་ཆོས་ཉིད་ཀྱང་གཞན། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་།
en: Blessed Lord, if one were to ask why, it is because if the reality of physical forms were one distinct thing, and the reality of feelings, perceptions, formative predispositions, and consciousness another; the reality of the sense fields, {Ki.

source: སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་ཆོས་ཉིད་ཀྱང་གཞན། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་ཆོས་ཉིད་ཀྱང་གཞན། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་།
en: VIII: 173} the sensory elements, and the links of dependent origination another; the reality of attachment another; the reality of hatred another; the reality of delusion another; the reality of the aspects of wrong view another; the reality of the perfection of generosity another; the reality of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom another; the reality of the emptiness of internal phenomena another; the reality of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity, another; the reality of the applications of mindfulness another; the reality of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path another; the reality of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and all the dhāraṇī gateways another; {Ki.

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་ཆོས་ཉིད་ཀྱང་གཞན། མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུའི་ཆོས་ཉིད་ཀྱང་གཞན།
en: VIII: 174} the reality of the ten powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas another; the reality of the thirty-two major marks of a great person and the eighty excellent minor marks another; and the reality of conditioned elements and unconditioned elements another, in that case, Blessed Lord, how would the reality of phenomena with dissimilar defining characteristics be of a single defining characteristic?

source: འདུས་བྱས་ཀྱི་ཁམས་དང་། འདུས་མ་བྱས་ཀྱི་ཁམས་ཀྱི་ཆོས་ཉིད་ཀྱང་གཞན་ན།
en: How would all those phenomena be established? “

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་མཚན་ཉིད་མི་འདྲ་བའི་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་མཚན་ཉིད་གཅིག་པར་འགྱུར་བ་ལགས། ཆོས་རྣམ་པར་དགོད་པར་ནི་ཇི་ལྟར་འགྱུར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གང་ལ་གནས་ཤིང་ཆོས་རྣམས་ཐ་དད་དུ་བགྱིད་པ་ལགས།
en: When bodhisattva great beings practice the perfection of wisdom, in what have they been established when they differentiate among phenomena?

source: ཆོས་རྣམས་ཐ་དད་དུ་མ་བགྱིས་པར་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པར་མི་ནུས་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ས་ནས་སར་འཕར་ཞིང་སྐྱོན་མེད་པར་འཇུག་པ་ལགས།
en: If bodhisattva great beings indeed cannot practice the perfection of wisdom without differentiating among phenomena, how, when practicing the perfection of wisdom, do they progress from level to level, and enter into the maturity [of the bodhisattvas]?

source: ཇི་ལྟར་སྐྱོན་མེད་པར་ཞུགས་ནས། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་ཏེ།
en: How, having entered into the maturity of the bodhisattvas, do they transcend the levels of the śrāvakas and the pratyekabuddhas?

source: མངོན་པར་ཤེས་པ་ཡོངས་སུ་རྫོགས་པར་བགྱིད་པ་ལགས། ཇི་ལྟར་མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེ་ཞིང་།
en: How do they perfect the extrasensory powers?

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བ་དང་།
en: How do they display the extrasensory powers, and perfect the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom?

source: དེ་དག་ལ་རྣམ་པར་རྩེ་བས་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་མཆི་བ་ལགས།
en: How, displaying these [extrasensory powers], do they travel from buddhafield to buddhafield?

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བགྱིད་པ་ལགས།
en: How do they venerate the lord buddhas, and develop the roots of virtuous action in their presence?

source: དེ་དག་ཏུ་ཡང་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ལགས། དགེ་བའི་རྩ་བ་དེས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་ལགས། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གང་འདི་སྐད་དུ་དེ་སྟེ་ཆོས་ཐམས་ཅད་ཀྱི།
en: How do they bring beings to maturation through those roots of virtuous action and acquire the buddhafields?” “

source: ཆོས་མཉམ་པ་ཉིད་གང་ཡིན་པ་དེ་ཉིད་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་ཆོས་མཉམ་པ་ཉིད་དེ། དེ་ཉིད་དད་པའི་རྗེས་སུ་འབྲང་བ་རྣམས་དང་། ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བ་རྣམས་དང་། བརྒྱད་པ་རྣམས་དང་། རྒྱུན་དུ་ཞུགས་པ་རྣམས་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་རྣམས་དང་། ཕྱིར་མི་འོང་བ་རྣམས་དང་། དགྲ་བཅོམ་པ་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཆོས་མཉམ་པ་ཉིད་ཡིན་ན། མཚན་ཉིད་མི་འདྲ་བའི་ཆོས་རྣམས་ཀྱི་མཉམ་པ་ཉིད་ཇི་ལྟར་གཅིག་པར་འགྱུར་ཞེས་ཟེར་བ་ནི།
en: Subhūti,” replied the Blessed One, “you asked: if the sameness of phenomena that all phenomena have is itself the sameness of phenomena that ordinary people have, and is itself the sameness of phenomena that followers on account of faith, followers of the Dharma, those of the eighth level, those entering the stream to nirvāṇa, those destined for only one more rebirth, those no longer subject to rebirth, arhats, pratyekabuddhas, bodhisattva great beings, and the tathāgatas, arhats, completely awakened buddhas have, in that case, Blessed Lord, how would the sameness of phenomena with dissimilar defining characteristics be unique?

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། གཟུགས་ཀྱི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ཉིད་སྟོང་པ་ཉིད་མ་ཡིན་ནམ།
en: Subhūti, do you think that the reality of physical forms is itself not emptiness? {Ki.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ཉིད་སྟོང་པ་ཉིད་མ་ཡིན་ནམ།
en: VIII: 175} Is the reality of feelings, perceptions, formative predispositions, and consciousness itself not emptiness?

source: སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ཉིད་སྟོང་པ་ཉིད་མ་ཡིན་ནམ།
en: Is the reality of the sense fields, the sensory elements, and the links of dependent origination itself not emptiness?

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ཉིད་སྟོང་པ་ཉིད་མ་ཡིན་ནམ།
en: Is the reality of the perfection of generosity itself not emptiness?

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ཉིད་སྟོང་པ་ཉིད་མ་ཡིན་ནམ།
en: Is the reality of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom itself not emptiness?

source: ནང་སྟོང་པ་ཉིད་ཀྱི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ཉིད་སྟོང་པ་ཉིད་མ་ཡིན་ནམ།
en: Is the reality of the emptiness of internal phenomena itself not emptiness?

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཆོས་ཉིད་གང་ཡིན་པ། དེ་ཉིད་སྟོང་པ་ཉིད་མ་ཡིན་ནམ།
en: Is the reality of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity, itself not emptiness?

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ཉིད་སྟོང་པ་ཉིད་མ་ཡིན་ནམ། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་།
en: Is the reality of the factors conducive to enlightenment itself not emptiness?

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ཉིད་སྟོང་པ་ཉིད་མ་ཡིན་ནམ།
en: Is the reality of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways itself not emptiness?

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ཉིད་སྟོང་པ་ཉིད་མ་ཡིན་ནམ།
en: Is the reality of the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great compassion, and the distinct qualities of the buddhas itself not emptiness?

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུའི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ཉིད་སྟོང་པ་ཉིད་མ་ཡིན་ནམ། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་།
en: Is the reality of the fruit of entering the stream to nirvāṇa itself not emptiness?

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ཉིད་སྟོང་པ་ཉིད་མ་ཡིན་ནམ། རྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་།
en: Is the reality of the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, and [the goals], up to and including all-aspect omniscience, itself not emptiness?

source: ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་གཤེགས་པའི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ཉིད་སྟོང་པ་ཉིད་མ་ཡིན་ནམ།
en: Is the reality of those entering the stream to nirvāṇa, those destined for only one more rebirth, those no longer subject to rebirth, arhats, pratyekabuddhas, bodhisattvas, and tathāgatas itself not emptiness?” “

source: གསོལ་པ་བཅོམ་ལྡན་འདས་དེ་ནི་སྟོང་པ་ཉིད་དོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འོ་ན་སྟོང་པ་ཉིད་ལ་གཟུགས་ཀྱི་མཚན་ཉིད་དམ། ཚོར་བ་དང་འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་མཚན་ཉིད་དམ། སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་མཚན་ཉིད་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་མཚན་ཉིད་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: Blessed Lord, it is emptiness!” “

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་མཚན་ཉིད་དམ། ནང་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་དམ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་མཚན་ཉིད་དམ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་མཚན་ཉིད་དམ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རི
en: In that case,” continued the Blessed One, “in emptiness can anything with different defining characteristics be apprehended, such as the defining characteristics of physical forms; the defining characteristics of feelings, perceptions, formative predispositions, and consciousness; the defining characteristics of the sense fields, the sensory elements, and the links of dependent origination; the defining characteristics of the perfection of generosity; the defining characteristics of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom; the defining characteristics of the emptiness of internal phenomena; the defining characteristics of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity; the defining characteristics of the factors conducive to enlightenment; the defining characteristics of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways; the defining characteristics of the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great compassion, and the distinct qualities of the buddhas; the defining characteristics of the fruit of entering the stream to nirvāṇa; the defining characteristics of the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, and [the goals], up to and including all-aspect omniscience; the defining characteristics of those entering the stream to nirvāṇa; or the defining characteristics of those destined for only one more rebirth, those no longer subject to rebirth, arhats, pratyekabuddhas, bodhisattvas, and tathāgatas?” “
